{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "VarGNet_Window", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad", "inbound_nodes": [["input_1", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_conv1", "inbound_nodes": [[["tf.compat.v1.pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "vargface_head_conv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "vargface_head_conv1_bn", "inbound_nodes": [[["vargface_head_conv1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_head_conv1_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_head_conv1_act", "inbound_nodes": [[["vargface_head_conv1_bn", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_2", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_2", "inbound_nodes": [["vargface_head_conv1_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_sep1_data", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 13}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_3", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_3", "inbound_nodes": [["vargface_head_head_pooling_sep1_data", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_sep2_data", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 20}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 23}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_sep2_data", "inbound_nodes": [[["tf.compat.v1.pad_3", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_head_head_pooling_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_head_head_pooling_se_pool1", "inbound_nodes": [[["vargface_head_head_pooling_sep2_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_head_pooling_se_conv1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_head_pooling_se_conv1", "inbound_nodes": [[["vargface_head_head_pooling_se_pool1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_head_head_pooling_se_act1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_head_head_pooling_se_act1", "inbound_nodes": [[["vargface_head_head_pooling_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_head_pooling_se_conv2", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_head_pooling_se_conv2", "inbound_nodes": [[["vargface_head_head_pooling_se_act1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_head_head_pooling_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_head_head_pooling_se_sigmoid", "inbound_nodes": [[["vargface_head_head_pooling_se_conv2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_1", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_1", "inbound_nodes": [["vargface_head_conv1_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "name": "multiply", "inbound_nodes": [[["vargface_head_head_pooling_sep2_data", 0, 0, {}], ["vargface_head_head_pooling_se_sigmoid", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_shortcut", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 37}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 40}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_shortcut", "inbound_nodes": [[["tf.compat.v1.pad_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["multiply", 0, 0, {}], ["vargface_head_head_pooling_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_head_head_pooling_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_head_head_pooling_out_data_act", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_5", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_5", "inbound_nodes": [["vargface_head_head_pooling_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_6", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_6", "inbound_nodes": [["vargface_head_head_pooling_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_step1_data_branch", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 47}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 50}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_step1_data_branch", "inbound_nodes": [[["tf.compat.v1.pad_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_step2_data_branch", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 53}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 56}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_step2_data_branch", "inbound_nodes": [[["tf.compat.v1.pad_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["vargface_stage_2_unit_1_step1_data_branch", 0, 0, {}], ["vargface_stage_2_unit_1_step2_data_branch", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_2_unit_1_step1_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_2_unit_1_step1_data_act", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_7", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_7", "inbound_nodes": [["vargface_stage_2_unit_1_step1_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_4", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_4", "inbound_nodes": [["vargface_head_head_pooling_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_step2_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 63}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 66}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_step2_data", "inbound_nodes": [[["tf.compat.v1.pad_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_shortcut", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 69}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 72}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_shortcut", "inbound_nodes": [[["tf.compat.v1.pad_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["vargface_stage_2_unit_1_step2_data", 0, 0, {}], ["vargface_stage_2_unit_1_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_2_unit_1_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_2_unit_1_out_data_act", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_8", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_8", "inbound_nodes": [["vargface_stage_2_unit_1_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_2_sep1_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 78}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 81}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_2_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_8", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_9", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_9", "inbound_nodes": [["vargface_stage_2_unit_2_sep1_data", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_2_sep2_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 85}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 88}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_2_sep2_data", "inbound_nodes": [[["tf.compat.v1.pad_9", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_2_unit_2_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_2_unit_2_se_pool1", "inbound_nodes": [[["vargface_stage_2_unit_2_sep2_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_2_se_conv1", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_2_se_conv1", "inbound_nodes": [[["vargface_stage_2_unit_2_se_pool1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_2_unit_2_se_act1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_2_unit_2_se_act1", "inbound_nodes": [[["vargface_stage_2_unit_2_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_2_se_conv2", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_2_se_conv2", "inbound_nodes": [[["vargface_stage_2_unit_2_se_act1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_2_unit_2_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_2_unit_2_se_sigmoid", "inbound_nodes": [[["vargface_stage_2_unit_2_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["vargface_stage_2_unit_2_sep2_data", 0, 0, {}], ["vargface_stage_2_unit_2_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["multiply_1", 0, 0, {}], ["vargface_stage_2_unit_1_out_data_act", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_2_unit_2_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_2_unit_2_out_data_act", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_10", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_10", "inbound_nodes": [["vargface_stage_2_unit_2_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_3_sep1_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 104}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 107}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_3_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_10", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_11", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_11", "inbound_nodes": [["vargface_stage_2_unit_3_sep1_data", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_3_sep2_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 111}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 114}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_3_sep2_data", "inbound_nodes": [[["tf.compat.v1.pad_11", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_2_unit_3_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_2_unit_3_se_pool1", "inbound_nodes": [[["vargface_stage_2_unit_3_sep2_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_3_se_conv1", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_3_se_conv1", "inbound_nodes": [[["vargface_stage_2_unit_3_se_pool1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_2_unit_3_se_act1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_2_unit_3_se_act1", "inbound_nodes": [[["vargface_stage_2_unit_3_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_3_se_conv2", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_3_se_conv2", "inbound_nodes": [[["vargface_stage_2_unit_3_se_act1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_2_unit_3_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_2_unit_3_se_sigmoid", "inbound_nodes": [[["vargface_stage_2_unit_3_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "name": "multiply_2", "inbound_nodes": [[["vargface_stage_2_unit_3_sep2_data", 0, 0, {}], ["vargface_stage_2_unit_3_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["multiply_2", 0, 0, {}], ["vargface_stage_2_unit_2_out_data_act", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_2_unit_3_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_2_unit_3_out_data_act", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_13", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_13", "inbound_nodes": [["vargface_stage_2_unit_3_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_14", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_14", "inbound_nodes": [["vargface_stage_2_unit_3_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_step1_data_branch", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 131}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 134}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_step1_data_branch", "inbound_nodes": [[["tf.compat.v1.pad_13", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_step2_data_branch", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 137}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 140}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_step2_data_branch", "inbound_nodes": [[["tf.compat.v1.pad_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["vargface_stage_3_unit_1_step1_data_branch", 0, 0, {}], ["vargface_stage_3_unit_1_step2_data_branch", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_3_unit_1_step1_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_3_unit_1_step1_data_act", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_15", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_15", "inbound_nodes": [["vargface_stage_3_unit_1_step1_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_12", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_12", "inbound_nodes": [["vargface_stage_2_unit_3_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_step2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 147}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 150}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_step2_data", "inbound_nodes": [[["tf.compat.v1.pad_15", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_shortcut", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 153}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 156}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_shortcut", "inbound_nodes": [[["tf.compat.v1.pad_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["vargface_stage_3_unit_1_step2_data", 0, 0, {}], ["vargface_stage_3_unit_1_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_3_unit_1_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_3_unit_1_out_data_act", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_16", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_16", "inbound_nodes": [["vargface_stage_3_unit_1_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_2_sep1_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 162}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 165}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_2_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_16", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_17", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_17", "inbound_nodes": [["vargface_stage_3_unit_2_sep1_data", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_2_sep2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 169}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 172}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_2_sep2_data", "inbound_nodes": [[["tf.compat.v1.pad_17", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_3_unit_2_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_3_unit_2_se_pool1", "inbound_nodes": [[["vargface_stage_3_unit_2_sep2_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_2_se_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_2_se_conv1", "inbound_nodes": [[["vargface_stage_3_unit_2_se_pool1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_3_unit_2_se_act1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_3_unit_2_se_act1", "inbound_nodes": [[["vargface_stage_3_unit_2_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_2_se_conv2", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_2_se_conv2", "inbound_nodes": [[["vargface_stage_3_unit_2_se_act1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_3_unit_2_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_3_unit_2_se_sigmoid", "inbound_nodes": [[["vargface_stage_3_unit_2_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true, "dtype": "float32"}, "name": "multiply_3", "inbound_nodes": [[["vargface_stage_3_unit_2_sep2_data", 0, 0, {}], ["vargface_stage_3_unit_2_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["multiply_3", 0, 0, {}], ["vargface_stage_3_unit_1_out_data_act", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_3_unit_2_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_3_unit_2_out_data_act", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_18", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_18", "inbound_nodes": [["vargface_stage_3_unit_2_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_3_sep1_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 188}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 191}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_3_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_18", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_19", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_19", "inbound_nodes": [["vargface_stage_3_unit_3_sep1_data", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_3_sep2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 195}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 198}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_3_sep2_data", "inbound_nodes": [[["tf.compat.v1.pad_19", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_3_unit_3_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_3_unit_3_se_pool1", "inbound_nodes": [[["vargface_stage_3_unit_3_sep2_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_3_se_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_3_se_conv1", "inbound_nodes": [[["vargface_stage_3_unit_3_se_pool1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_3_unit_3_se_act1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_3_unit_3_se_act1", "inbound_nodes": [[["vargface_stage_3_unit_3_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_3_se_conv2", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_3_se_conv2", "inbound_nodes": [[["vargface_stage_3_unit_3_se_act1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_3_unit_3_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_3_unit_3_se_sigmoid", "inbound_nodes": [[["vargface_stage_3_unit_3_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": "float32"}, "name": "multiply_4", "inbound_nodes": [[["vargface_stage_3_unit_3_sep2_data", 0, 0, {}], ["vargface_stage_3_unit_3_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["multiply_4", 0, 0, {}], ["vargface_stage_3_unit_2_out_data_act", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_stage_3_unit_3_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "vargface_stage_3_unit_3_out_data_act", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_20", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_20", "inbound_nodes": [["vargface_stage_3_unit_3_out_data_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_4_sep1_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "shared_object_id": 214}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 217}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_4_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_20", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_21", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_21", 