{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad", "inbound_nodes": [["input_1", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_conv1", "inbound_nodes": [[["tf.compat.v1.pad", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["vargface_head_conv1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "vargface_head_conv1/kernel", "shape": [3, 3, 3, 40], "dtype": "float32"}]}]}