{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "retinaface_VarGNet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 640, 640, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "RetinaFaceModel_input_image"}, "name": "RetinaFaceModel_input_image", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "VarGNet_extrator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 640, 640, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_head_conv1", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "vargface_head_conv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "vargface_head_conv1_bn", "inbound_nodes": [[["vargface_head_conv1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu", "inbound_nodes": [[["vargface_head_conv1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_2", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_sep1_data", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 13}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_sep1_data", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_3", "inbound_nodes": [[["vargface_head_head_pooling_sep1_data", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_sep2_data", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 20}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 23}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_sep2_data", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_head_head_pooling_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_head_head_pooling_se_pool1", "inbound_nodes": [[["vargface_head_head_pooling_sep2_data", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 40]}, "name": "reshape", "inbound_nodes": [[["vargface_head_head_pooling_se_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_head_pooling_se_conv1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_head_head_pooling_se_conv1", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_4", "inbound_nodes": [[["vargface_head_head_pooling_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_head_pooling_se_conv2", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_head_head_pooling_se_conv2", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_head_head_pooling_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_head_head_pooling_se_sigmoid", "inbound_nodes": [[["vargface_head_head_pooling_se_conv2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "name": "multiply", "inbound_nodes": [[["vargface_head_head_pooling_sep2_data", 0, 0, {}], ["vargface_head_head_pooling_se_sigmoid", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_shortcut", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 38}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 41}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_shortcut", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["multiply", 0, 0, {}], ["vargface_head_head_pooling_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_5", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_6", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_step1_data_branch", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 48}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 51}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_step1_data_branch", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_step2_data_branch", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 54}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 57}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_step2_data_branch", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["vargface_stage_2_unit_1_step1_data_branch", 0, 0, {}], ["vargface_stage_2_unit_1_step2_data_branch", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_9", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_7", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_4", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_step2_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 64}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 67}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_step2_data", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_1_shortcut", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 70}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 73}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_1_shortcut", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["vargface_stage_2_unit_1_step2_data", 0, 0, {}], ["vargface_stage_2_unit_1_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_11", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_8", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_2_sep1_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 79}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 82}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_2_sep1_data", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_9", "inbound_nodes": [[["vargface_stage_2_unit_2_sep1_data", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_2_sep2_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 86}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 89}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_2_sep2_data", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_2_unit_2_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_2_unit_2_se_pool1", "inbound_nodes": [[["vargface_stage_2_unit_2_sep2_data", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 80]}, "name": "reshape_1", "inbound_nodes": [[["vargface_stage_2_unit_2_se_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_2_se_conv1", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_2_se_conv1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_14", "inbound_nodes": [[["vargface_stage_2_unit_2_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_2_se_conv2", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_2_se_conv2", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_2_unit_2_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_2_unit_2_se_sigmoid", "inbound_nodes": [[["vargface_stage_2_unit_2_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["vargface_stage_2_unit_2_sep2_data", 0, 0, {}], ["vargface_stage_2_unit_2_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["multiply_1", 0, 0, {}], ["leaky_re_lu_11", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_15", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_10", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_3_sep1_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 106}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 109}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_3_sep1_data", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_11", "inbound_nodes": [[["vargface_stage_2_unit_3_sep1_data", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_2_unit_3_sep2_data", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 113}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 116}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_2_unit_3_sep2_data", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_2_unit_3_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_2_unit_3_se_pool1", "inbound_nodes": [[["vargface_stage_2_unit_3_sep2_data", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 80]}, "name": "reshape_2", "inbound_nodes": [[["vargface_stage_2_unit_3_se_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_3_se_conv1", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_3_se_conv1", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_18", "inbound_nodes": [[["vargface_stage_2_unit_3_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_2_unit_3_se_conv2", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_2_unit_3_se_conv2", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_2_unit_3_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_2_unit_3_se_sigmoid", "inbound_nodes": [[["vargface_stage_2_unit_3_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "name": "multiply_2", "inbound_nodes": [[["vargface_stage_2_unit_3_sep2_data", 0, 0, {}], ["vargface_stage_2_unit_3_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["multiply_2", 0, 0, {}], ["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_19", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_13", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_14", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_step1_data_branch", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 134}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 137}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_step1_data_branch", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_step2_data_branch", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 140}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 143}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_step2_data_branch", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["vargface_stage_3_unit_1_step1_data_branch", 0, 0, {}], ["vargface_stage_3_unit_1_step2_data_branch", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_23", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_15", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_12", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_step2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 150}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 153}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_step2_data", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_1_shortcut", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 156}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 159}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_1_shortcut", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["vargface_stage_3_unit_1_step2_data", 0, 0, {}], ["vargface_stage_3_unit_1_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_25", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_16", "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_2_sep1_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 165}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 168}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_2_sep1_data", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_17", "inbound_nodes": [[["vargface_stage_3_unit_2_sep1_data", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_2_sep2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 172}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 175}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_2_sep2_data", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_3_unit_2_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_3_unit_2_se_pool1", "inbound_nodes": [[["vargface_stage_3_unit_2_sep2_data", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 160]}, "name": "reshape_3", "inbound_nodes": [[["vargface_stage_3_unit_2_se_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_2_se_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_2_se_conv1", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_28", "inbound_nodes": [[["vargface_stage_3_unit_2_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_2_se_conv2", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_2_se_conv2", "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_3_unit_2_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_3_unit_2_se_sigmoid", "inbound_nodes": [[["vargface_stage_3_unit_2_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true, "dtype": "float32"}, "name": "multiply_3", "inbound_nodes": [[["vargface_stage_3_unit_2_sep2_data", 0, 0, {}], ["vargface_stage_3_unit_2_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["multiply_3", 0, 0, {}], ["leaky_re_lu_25", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_29", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_18", "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_3_sep1_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 192}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 195}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_3_sep1_data", "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_19", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_19", "inbound_nodes": [[["vargface_stage_3_unit_3_sep1_data", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_3_sep2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_31", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 199}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 202}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_3_sep2_data", "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_3_unit_3_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_3_unit_3_se_pool1", "inbound_nodes": [[["vargface_stage_3_unit_3_sep2_data", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 160]}, "name": "reshape_4", "inbound_nodes": [[["vargface_stage_3_unit_3_se_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_3_se_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_3_se_conv1", "inbound_nodes": [[["reshape_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_32", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_32", "inbound_nodes": [[["vargface_stage_3_unit_3_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_stage_3_unit_3_se_conv2", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "vargface_stage_3_unit_3_se_conv2", "inbound_nodes": [[["leaky_re_lu_32", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_stage_3_unit_3_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_stage_3_unit_3_se_sigmoid", "inbound_nodes": [[["vargface_stage_3_unit_3_se_conv2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": "float32"}, "name": "multiply_4", "inbound_nodes": [[["vargface_stage_3_unit_3_sep2_data", 0, 0, {}], ["vargface_stage_3_unit_3_se_sigmoid", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["multiply_4", 0, 0, {}], ["leaky_re_lu_29", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_33", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "leaky_re_lu_33", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_20", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_20", "inbound_nodes": [[["leaky_re_lu_33", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_4_sep1_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_34", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 219}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 222}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_4_sep1_data", "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_21", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_21", "inbound_nodes": [[["vargface_stage_3_unit_4_sep1_data", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_stage_3_unit_4_sep2_data", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_35", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 226}, "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 229}, "depthwise_intializer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_stage_3_unit_4_sep2_data", "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_stage_3_unit_4_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_stage_3_unit_4_se_pool1", "inbound_nodes": [[["vargface_stage_3_unit_4_sep2_data", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 160]}, "name": "reshape_5", "inbound_nodes": [[["vargface_stage_3_unit_4_se_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": 