{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad", "inbound_nodes": [["input_1", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_conv1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_conv1", "inbound_nodes": [[["tf.compat.v1.pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "vargface_head_conv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "vargface_head_conv1_bn", "inbound_nodes": [[["vargface_head_conv1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_head_conv1_act", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "vargface_head_conv1_act", "inbound_nodes": [[["vargface_head_conv1_bn", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_2", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_2", "inbound_nodes": [["vargface_head_conv1_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_sep1_data", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 12}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 15}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_sep1_data", "inbound_nodes": [[["tf.compat.v1.pad_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_3", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_3", "inbound_nodes": [["vargface_head_head_pooling_sep1_data", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_sep2_data", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 19}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 22}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_sep2_data", "inbound_nodes": [[["tf.compat.v1.pad_3", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "vargface_head_head_pooling_se_pool1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "name": "vargface_head_head_pooling_se_pool1", "inbound_nodes": [[["vargface_head_head_pooling_sep2_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_head_pooling_se_conv1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_head_pooling_se_conv1", "inbound_nodes": [[["vargface_head_head_pooling_se_pool1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_head_head_pooling_se_act1", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "vargface_head_head_pooling_se_act1", "inbound_nodes": [[["vargface_head_head_pooling_se_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "vargface_head_head_pooling_se_conv2", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vargface_head_head_pooling_se_conv2", "inbound_nodes": [[["vargface_head_head_pooling_se_act1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "vargface_head_head_pooling_se_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "vargface_head_head_pooling_se_sigmoid", "inbound_nodes": [[["vargface_head_head_pooling_se_conv2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_1", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_1", "inbound_nodes": [["vargface_head_conv1_act", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "name": "multiply", "inbound_nodes": [[["vargface_head_head_pooling_sep2_data", 0, 0, {}], ["vargface_head_head_pooling_se_sigmoid", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "vargface_head_head_pooling_shortcut", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.1}, "shared_object_id": 36}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 39}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "vargface_head_head_pooling_shortcut", "inbound_nodes": [[["tf.compat.v1.pad_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["multiply", 0, 0, {}], ["vargface_head_head_pooling_shortcut", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "vargface_head_head_pooling_out_data_act", "trainable": true, "dtype": "float32", "alpha": 0.1}, "name": "vargface_head_head_pooling_out_data_act", "inbound_nodes": [[["add", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["vargface_head_head_pooling_out_data_act", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "vargface_head_conv1/kernel", "shape": [3, 3, 3, 40], "dtype": "float32"}, {"name": "vargface_head_conv1_bn/beta", "shape": [40], "dtype": "float32"}, {"name": "vargface_head_conv1_bn/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "vargface_head_conv1_bn/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "vargface_head_head_pooling_se_conv1/kernel", "shape": [1, 1, 40, 10], "dtype": "float32"}, {"name": "vargface_head_head_pooling_se_conv1/bias", "shape": [10], "dtype": "float32"}, {"name": "vargface_head_head_pooling_se_conv2/kernel", "shape": [1, 1, 10, 40], "dtype": "float32"}, {"name": "vargface_head_head_pooling_se_conv2/bias", "shape": [40], "dtype": "float32"}, {"name": "vargface_head_head_pooling_sep1_data/depthwise_kernel", "shape": [3, 3, 40, 1], "dtype": "float32"}, {"name": "vargface_head_head_pooling_sep1_data/pointwise_kernel", "shape": [1, 1, 40, 40], "dtype": "float32"}, {"name": "vargface_head_head_pooling_sep2_data/depthwise_kernel", "shape": [3, 3, 40, 1], "dtype": "float32"}, {"name": "vargface_head_head_pooling_sep2_data/pointwise_kernel", "shape": [1, 1, 40, 40], "dtype": "float32"}, {"name": "vargface_head_head_pooling_shortcut/depthwise_kernel", "shape": [3, 3, 40, 1], "dtype": "float32"}, {"name": "vargface_head_head_pooling_shortcut/pointwise_kernel", "shape": [1, 1, 40, 40], "dtype": "float32"}]}]}